{
  "architectures": [
    "VideoMAEForVideoClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 384,
  "decoder_intermediate_size": 1536,
  "decoder_num_attention_heads": 6,
  "decoder_num_hidden_layers": 4,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 384,
  "id2label": {
    "0": "A",
    "1": "B1",
    "2": "B2",
    "3": "B4",
    "4": "B5",
    "5": "B6",
    "6": "G"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "A": 0,
    "B1": 1,
    "B2": 2,
    "B4": 3,
    "B5": 4,
    "B6": 5,
    "G": 6
  },
  "layer_norm_eps": 1e-12,
  "mask_ratio": 0.0,
  "model_type": "videomae",
  "norm_pix_loss": true,
  "num_attention_heads": 6,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 4,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "tubelet_size": 2,
  "use_mean_pooling": true
}
